Circulemos2/Circulemos2WSCXF/src/main/webapp/wsdl/serviciorecibircomparendo.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="ServicioRecibirComparendoService"
	targetNamespace="http://recepcion.comparendo.ws.c2.datatools.com.co/"
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
	xmlns:tns="http://recepcion.comparendo.ws.c2.datatools.com.co/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns="http://schemas.xmlsoap.org/wsdl/" 
	xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:wsaws="http://www.w3.org/2005/08/addressing" 
	xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
	<wsdl:types>
		<schema xmlns="http://www.w3.org/2001/XMLSchema">
			<import namespace="http://recepcion.comparendo.ws.c2.datatools.com.co/"
				schemaLocation="serviciorecibircomparendo_schema1.xsd" />
		</schema>
	</wsdl:types>
	<wsdl:message name="recibirComparendo">
		<wsdl:part name="parameters" element="tns:recibirComparendo">
		</wsdl:part>
	</wsdl:message>
	<wsdl:message name="recibirComparendoResponse">
		<wsdl:part name="parameters" element="tns:recibirComparendoResponse">
		</wsdl:part>
	</wsdl:message>
	<wsdl:portType name="IServicioRecibirComparendo">
		<wsdl:operation name="recibirComparendo">
			<wsdl:input name="recibirComparendo" message="tns:recibirComparendo">
			</wsdl:input>
			<wsdl:output name="recibirComparendoResponse" message="tns:recibirComparendoResponse">
			</wsdl:output>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="ServicioRecibirComparendoServiceSoapBinding"
		type="tns:IServicioRecibirComparendo">
		<wsp:PolicyReference URI="#SecurityServiceBindingPolicy" />
		<soap:binding style="document"
			transport="http://schemas.xmlsoap.org/soap/http" />
		<wsdl:operation name="recibirComparendo">
			<soap:operation soapAction="urn:RecibirComparendo"
				style="document" />
			<wsdl:input name="recibirComparendo">
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output name="recibirComparendoResponse">
				<soap:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="ServicioRecibirComparendoService">
		<wsdl:port name="ServicioRecibirComparendoPort"
			binding="tns:ServicioRecibirComparendoServiceSoapBinding">
			<soap:address location="http://localhost:9090/ServicioRecibirComparendoPort" />
		</wsdl:port>
	</wsdl:service>
	<!-- Token en texto plano -->
	<wsp:Policy wsu:Id="SecurityServiceBindingPolicy">
		<wsp:ExactlyOne>
			<wsp:All>
				<sp:SupportingTokens
					xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702">
					<wsp:Policy>
						<sp:UsernameToken
							sp:IncludeToken="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702/IncludeToken/AlwaysToRecipient">
							<wsp:Policy>
								<sp:WssUsernameToken10 />
							</wsp:Policy>
						</sp:UsernameToken>
					</wsp:Policy>
				</sp:SupportingTokens>
			</wsp:All>
		</wsp:ExactlyOne>
	</wsp:Policy>
</wsdl:definitions>
